In [1]:
import pandas as pd

In [8]:
file_path = "StockData.csv"
df = pd.read_csv(file_path)
df.head()

  stock        date    price
0  AAPL  08-02-2013  67.8542
1  AAPL  11-02-2013  68.5614
2  AAPL  12-02-2013  66.8428
3  AAPL  13-02-2013  66.7156
4  AAPL  14-02-2013  66.6556

In [34]:
df.tail()

     stock        date  price
5031   ZTS  01-02-2018  77.82
5032   ZTS  02-02-2018  76.78
5033   ZTS  05-02-2018  73.83
5034   ZTS  06-02-2018  73.27
5035   ZTS  07-02-2018  73.86

In [36]:
df.sample(5)

     stock        date   price
3553   TJX  21-03-2017   78.09
2609   TJX  20-06-2013   48.97
3354   TJX  06-06-2016   76.00
2130   SNI  26-07-2016   66.87
642   AAPL  27-08-2015  112.92

In [9]:
df.shape

(5036, 3)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5036 entries, 0 to 5035
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   stock   5036 non-null   object
 1   date    5036 non-null   object
 2   price   5036 non-null   float64
dtypes: float64(1), object(2)
memory usage: 118.2+ KB

In [12]:
# descriptive statistics
df.describe()

             price
count  5036.000000
mean     73.057030
std      29.011126
min      28.400000
25%      54.067500
50%      69.085000
75%      79.250000
max     179.260000

In [20]:
df.isnull()

      stock   date  price
0     False  False  False
1     False  False  False
2     False  False  False
3     False  False  False
4     False  False  False
...     ...    ...    ...
5031  False  False  False
5032  False  False  False
5033  False  False  False
5034  False  False  False
5035  False  False  False

[5036 rows x 3 columns]

In [22]:
df.isnull().values

array([[False, False, False],
       [False, False, False],
       [False, False, False],
       ...,
       [False, False, False],
       [False, False, False],
       [False, False, False]])

In [25]:
df.isnull().values.any()

False

In [26]:
df.isnull().values.sum()

0

In [29]:
df.dtypes

stock     object
date      object
price    float64
dtype: object

In [30]:
df.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
5031    False
5032    False
5033    False
5034    False
5035    False
Length: 5036, dtype: bool

In [31]:
df.duplicated().sum()

0

In [32]:
df.duplicated().any()

False

In [33]:
df.duplicated().values

array([False, False, False, ..., False, False, False])

In [39]:
df['price'].min()

28.4

In [40]:
df['price'].max()

179.26

In [41]:
for i in range(5036):
    if df['price'][i] == df['price'].max():
        print(i)
        break

1244

In [43]:
df[ df['price'] == df['price'].min() ]

     stock        date  price
4072   ZTS  11-04-2014   28.4

In [45]:
df['price'] == df['price'].min()

0       False
1       False
2       False
3       False
4       False
        ...
5031    False
5032    False
5033    False
5034    False
5035    False
Name: price, Length: 5036, dtype: bool

In [47]:
df[ df['price'] == df['price'].max() ]

     stock        date   price
1244  AAPL  18-01-2018  179.26

In [49]:
df['stock'].unique()

array(['AAPL', 'SNI', 'TJX', 'ZTS'], dtype=object)

In [51]:
df['stock'].nunique()

4

In [56]:
df['stock'].value_counts()

stock
AAPL    1259
SNI     1259
TJX     1259
ZTS     1259
Name: count, dtype: int64

In [59]:
df['stock'].value_counts(normalize=True)

stock
AAPL    0.25
SNI     0.25
TJX     0.25
ZTS     0.25
Name: proportion, dtype: float64

In [60]:
df.shape

(5036, 3)

In [64]:
new_file_path = "new.xlsx"
new_df = pd.read_excel(new_file_path)
new_df.head()

  stock                 date    price
0  AAPL  2013-08-02 00:00:00  67.8542
1  AAPL  2013-11-02 00:00:00      NaN
2  AAPL  2013-12-02 00:00:00      NaN
3  AAPL           13-02-2013      NaN
4  AAPL           14-02-2013  66.6556

In [65]:
new_df.isnull().sum()

stock    0
date     0
price    3
dtype: int64

In [66]:
new_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5036 entries, 0 to 5035
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   stock   5036 non-null   object
 1   date    5036 non-null   object
 2   price   5033 non-null   float64
dtypes: float64(1), object(2)
memory usage: 118.2+ KB

In [67]:
new_df.describe()

             price
count  5033.000000
mean     73.060418
std      29.019434
min      28.400000
25%      54.030000
50%      69.090000
75%      79.250000
max     179.260000

In [69]:
new_df['stock'].unique()

array(['AAPL', '?', 'SNI', 'TJX', 'ZTS'], dtype=object)

In [71]:
new_df.groupby(['stock'])['price'].sum()

stock
?           63.2571
AAPL    137049.5965
SNI      89790.8800
TJX      84030.1500
ZTS      56779.1980
Name: price, dtype: float64

In [72]:
new_df.groupby(['stock'])['price'].sum()

stock
?           63.2571
AAPL    137049.5965
SNI      89790.8800
TJX      84030.1500
ZTS      56779.1980
Name: price, dtype: float64

In [74]:
new_df.sort_values(by='price')

     stock                 date   price
4072   ZTS  2014-11-04 00:00:00   28.40
4073   ZTS           14-04-2014   28.48
4075   ZTS           16-04-2014   28.53
4074   ZTS           15-04-2014   28.55
4076   ZTS           17-04-2014   28.60
...    ...                  ...     ...
1243  AAPL           17-01-2018  179.10
1244  AAPL           18-01-2018  179.26
1     AAPL  2013-11-02 00:00:00     NaN
2     AAPL  2013-12-02 00:00:00     NaN
3     AAPL           13-02-2013     NaN

[5036 rows x 3 columns]

In [76]:
new_df.sort_values(by='price',ascending=False)

     stock                 date   price
1244  AAPL           18-01-2018  179.26
1243  AAPL           17-01-2018  179.10
1245  AAPL           19-01-2018  178.46
1241  AAPL  2018-12-01 00:00:00  177.09
1247  AAPL           23-01-2018  177.04
...    ...                  ...     ...
4073   ZTS           14-04-2014   28.48
4072   ZTS  2014-11-04 00:00:00   28.40
1     AAPL  2013-11-02 00:00:00     NaN
2     AAPL  2013-12-02 00:00:00     NaN
3     AAPL           13-02-2013     NaN

[5036 rows x 3 columns]

In [77]:
df3 = pd.read_csv("Predictive_Maintenance_Case_Study.csv")
df3.head()

,UDI,Type,Air temperature,Process temperature,Rotational speed,Torque,Tool wear,Failure
0,1,M,298.1,323.740741,1551,42.8,0,0
1,2,L,298.2,324.111111,1408,46.3,3,0
2,3,L,298.1,323.370370,1498,49.4,5,0
3,4,L,298.2,323.740741,1433,39.5,7,0
4,5,L,298.2,324.111111,1408,40.0,9,0

In [86]:
df3.dtypes

UDI                      int64
Type                    object
Air temperature        float64
Process temperature    float64
Rotational speed         int64
Torque                 float64
Tool wear                int64
Failure                  int64
dtype: object

In [81]:
df3.describe()

,UDI,Air temperature,Process temperature,Rotational speed,Torque,Tool wear,Failure
count,10000.00000,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000,10000.000000
mean,5000.50000,300.004930,328.946519,1538.776100,39.986910,107.951000,0.033900
std,2886.89568,2.000259,5.495312,179.284096,9.968934,63.654147,0.180981
min,1.00000,295.300000,313.000000,1168.000000,3.800000,0.000000,0.000000
25%,2500.75000,298.300000,324.481481,1423.000000,33.200000,53.000000,0.000000
50%,5000.50000,300.100000,329.296296,1503.000000,40.100000,108.000000,0.000000
75%,7500.25000,301.500000,333.000000,1612.000000,46.800000,162.000000,0.000000
max,10000.00000,304.500000,343.000000,2886.000000,76.600000,253.000000,1.000000

In [82]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 8 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   UDI                  10000 non-null  int64
 1   Type                 10000 non-null  object
 2   Air temperature      10000 non-null  float64
 3   Process temperature  10000 non-null  float64
 4   Rotational speed     10000 non-null  int64
 5   Torque               10000 non-null  float64
 6   Tool wear            10000 non-null  int64
 7   Failure              10000 non-null  int64
dtypes: float64(3), int64(4), object(1)
memory usage: 625.1+ KB

In [87]:
df3.isnull()

,UDI,Type,Air temperature,Process temperature,Rotational speed,Torque,Tool wear,Failure
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
9995,False,False,False,False,False,False,False,False
9996,False,False,False,False,False,False,False,False
9997,False,False,False,False,False,False,False,False
9998,False,False,False,False,False,False,False,False
9999,False,False,False,False,False,False,False,False

In [88]:
df3.isnull().sum()

UDI                    0
Type                   0
Air temperature        0
Process temperature    0
Rotational speed       0
Torque                 0
Tool wear              0
Failure                0
dtype: int64